In [1]:
import numpy as np
import pandas as pd

In [2]:
data = {
    'Date': pd.date_range('2023-01-01', periods=20),
    'Product': ['A', 'B', 'C', 'D'] * 5,
    'Region': [
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South',
        'East', 'West', 'North', 'South'
    ],
    'Sales': np.random.randint(100, 1000, 20),
    'Units': np.random.randint(10, 100, 20),
    'Rep': [
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice',
        'John', 'Mary', 'Bob', 'Alice'
    ]
}

df = pd.DataFrame(data)

df['Month'] = df['Date'].dt.month_name()
df['Quarter'] = 'Q' + df['Date'].dt.quarter.astype(str)

In [3]:
df

         Date Product Region  Sales  Units    Rep    Month Quarter
0  2023-01-01       A   East    770     12   John  January      Q1
1  2023-01-02       B   West    499     82   Mary  January      Q1
2  2023-01-03       C  North    656     39    Bob  January      Q1
3  2023-01-04       D  South    523     76  Alice  January      Q1
4  2023-01-05       A   East    938     27   John  January      Q1
5  2023-01-06       B   West    899     55   Mary  January      Q1
6  2023-01-07       C  North    915     73    Bob  January      Q1
7  2023-01-08       D  South    901     98  Alice  January      Q1
8  2023-01-09       A   East    479     16   John  January      Q1
9  2023-01-10       B   West    428     63   Mary  January      Q1
10 2023-01-11       C  North    607     35    Bob  January      Q1
11 2023-01-12       D  South    694     83  Alice  January      Q1
12 2023-01-13       A   East    669     28   John  January      Q1
13 2023-01-14       B   West    558     99   Mary  January      Q1
14 2023-01-15       C  North    724     65    Bob  January      Q1
15 2023-01-16       D  South    780     11  Alice  January      Q1
16 2023-01-17       A   East    731     57   John  January      Q1
17 2023-01-18       B   West    267     86   Mary  January      Q1
18 2023-01-19       C  North    893     62    Bob  January      Q1
19 2023-01-20       D  South    182     12  Alice  January      Q1

In [5]:
pd.pivot_table(df, values="Sales", index="Region", columns="Product",aggfunc= "median")

Product      A      B      C      D
Region
East     731.0    NaN    NaN    NaN
North      NaN    NaN  724.0    NaN
South      NaN    NaN    NaN  694.0
West       NaN  499.0    NaN    NaN

In [6]:
pd.pivot_table(df, values=["Sales", "Units"], index="Region", columns="Product",aggfunc= "median")

         Sales                      Units
Product      A      B      C      D     A     B     C     D
Region
East     731.0    NaN    NaN    NaN  27.0   NaN   NaN   NaN
North      NaN    NaN  724.0    NaN   NaN   NaN  62.0   NaN
South      NaN    NaN    NaN  694.0   NaN   NaN   NaN  76.0
West       NaN  499.0    NaN    NaN   NaN  82.0   NaN   NaN

In [7]:
# CROSS TABS

In [8]:
pd.crosstab(df["Region"], df["Product"])

Product  A  B  C  D
Region
East     5  0  0  0
North    0  0  5  0
South    0  0  0  5
West     0  5  0  0